espressif/esp-idf/components/soc/esp32s2beta/include/soc/sens_reg.h
#define SENS_SAR_TOUCH_STATUS3_REG          (DR_REG_SENS_BASE + 0x00e4)
/* SENS_TOUCH_PAD3_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD3_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD3_DEBOUNCE_M  ((SENS_TOUCH_PAD3_DEBOUNCE_V)<<(SENS_TOUCH_PAD3_DEBOUNCE_S))
#define SENS_TOUCH_PAD3_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD3_DEBOUNCE_S  29
/* SENS_TOUCH_PAD3_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD3_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD3_BENCHMARK_M  ((SENS_TOUCH_PAD3_BENCHMARK_V)<<(SENS_TOUCH_PAD3_BENCHMARK_S))
#define SENS_TOUCH_PAD3_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD3_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS4_REG          (DR_REG_SENS_BASE + 0x00e8)
/* SENS_TOUCH_PAD4_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD4_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD4_DEBOUNCE_M  ((SENS_TOUCH_PAD4_DEBOUNCE_V)<<(SENS_TOUCH_PAD4_DEBOUNCE_S))
#define SENS_TOUCH_PAD4_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD4_DEBOUNCE_S  29
/* SENS_TOUCH_PAD4_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD4_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD4_BENCHMARK_M  ((SENS_TOUCH_PAD4_BENCHMARK_V)<<(SENS_TOUCH_PAD4_BENCHMARK_S))
#define SENS_TOUCH_PAD4_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD4_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS5_REG          (DR_REG_SENS_BASE + 0x00ec)
/* SENS_TOUCH_PAD5_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD5_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD5_DEBOUNCE_M  ((SENS_TOUCH_PAD5_DEBOUNCE_V)<<(SENS_TOUCH_PAD5_DEBOUNCE_S))
#define SENS_TOUCH_PAD5_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD5_DEBOUNCE_S  29
/* SENS_TOUCH_PAD5_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD5_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD5_BENCHMARK_M  ((SENS_TOUCH_PAD5_BENCHMARK_V)<<(SENS_TOUCH_PAD5_BENCHMARK_S))
#define SENS_TOUCH_PAD5_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD5_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS6_REG          (DR_REG_SENS_BASE + 0x00f0)
/* SENS_TOUCH_PAD6_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD6_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD6_DEBOUNCE_M  ((SENS_TOUCH_PAD6_DEBOUNCE_V)<<(SENS_TOUCH_PAD6_DEBOUNCE_S))
#define SENS_TOUCH_PAD6_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD6_DEBOUNCE_S  29
/* SENS_TOUCH_PAD6_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD6_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD6_BENCHMARK_M  ((SENS_TOUCH_PAD6_BENCHMARK_V)<<(SENS_TOUCH_PAD6_BENCHMARK_S))
#define SENS_TOUCH_PAD6_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD6_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS7_REG          (DR_REG_SENS_BASE + 0x00f4)
/* SENS_TOUCH_PAD7_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD7_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD7_DEBOUNCE_M  ((SENS_TOUCH_PAD7_DEBOUNCE_V)<<(SENS_TOUCH_PAD7_DEBOUNCE_S))
#define SENS_TOUCH_PAD7_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD7_DEBOUNCE_S  29
/* SENS_TOUCH_PAD7_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD7_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD7_BENCHMARK_M  ((SENS_TOUCH_PAD7_BENCHMARK_V)<<(SENS_TOUCH_PAD7_BENCHMARK_S))
#define SENS_TOUCH_PAD7_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD7_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS8_REG          (DR_REG_SENS_BASE + 0x00f8)
/* SENS_TOUCH_PAD8_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD8_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD8_DEBOUNCE_M  ((SENS_TOUCH_PAD8_DEBOUNCE_V)<<(SENS_TOUCH_PAD8_DEBOUNCE_S))
#define SENS_TOUCH_PAD8_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD8_DEBOUNCE_S  29
/* SENS_TOUCH_PAD8_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD8_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD8_BENCHMARK_M  ((SENS_TOUCH_PAD8_BENCHMARK_V)<<(SENS_TOUCH_PAD8_BENCHMARK_S))
#define SENS_TOUCH_PAD8_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD8_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS9_REG          (DR_REG_SENS_BASE + 0x00fc)
/* SENS_TOUCH_PAD9_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD9_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD9_DEBOUNCE_M  ((SENS_TOUCH_PAD9_DEBOUNCE_V)<<(SENS_TOUCH_PAD9_DEBOUNCE_S))
#define SENS_TOUCH_PAD9_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD9_DEBOUNCE_S  29
/* SENS_TOUCH_PAD9_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD9_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD9_BENCHMARK_M  ((SENS_TOUCH_PAD9_BENCHMARK_V)<<(SENS_TOUCH_PAD9_BENCHMARK_S))
#define SENS_TOUCH_PAD9_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD9_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS10_REG          (DR_REG_SENS_BASE + 0x0100)
/* SENS_TOUCH_PAD10_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD10_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD10_DEBOUNCE_M  ((SENS_TOUCH_PAD10_DEBOUNCE_V)<<(SENS_TOUCH_PAD10_DEBOUNCE_S))
#define SENS_TOUCH_PAD10_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD10_DEBOUNCE_S  29
/* SENS_TOUCH_PAD10_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD10_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD10_BENCHMARK_M  ((SENS_TOUCH_PAD10_BENCHMARK_V)<<(SENS_TOUCH_PAD10_BENCHMARK_S))
#define SENS_TOUCH_PAD10_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD10_BENCHMARK_S  0

#define SENS_SAR_TOUCH_STATUS11_REG          (DR_REG_SENS_BASE + 0x0104)
/* SENS_TOUCH_PAD11_DEBOUNCE : RO ;bitpos:[31:29] ;default: 3'd0 ; */
/*description: */
#define SENS_TOUCH_PAD11_DEBOUNCE  0x00000007
#define SENS_TOUCH_PAD11_DEBOUNCE_M  ((SENS_TOUCH_PAD11_DEBOUNCE_V)<<(SENS_TOUCH_PAD11_DEBOUNCE_S))
#define SENS_TOUCH_PAD11_DEBOUNCE_V  0x7
#define SENS_TOUCH_PAD11_DEBOUNCE_S  29
/* SENS_TOUCH_PAD11_BENCHMARK : RO ;bitpos:[21:0] ;default: 22'h0 ; */
/*description: */
#define SENS_TOUCH_PAD11_BENCHMARK  0x003FFFFF
#define SENS_TOUCH_PAD11_BENCHMARK_M  ((SENS_TOUCH_PAD11_BENCHMARK_V)<<(SENS_TOUCH_PAD11_BENCHMARK_S))
#define SENS_TOUCH_PAD11_BENCHMARK_V  0x3FFFFF
#define SENS_TOUCH_PAD11_BENCHMARK_S  0

